<template>
<div>
  <hr>
  <el-table :data="tableData.slice((currentPage-1)*pageSize,currentPage*pageSize)" border style="width: 100%">
      <el-table-column prop="公司名称" label="公司名称" align="center" width="70">
      </el-table-column>
      <el-table-column prop="A股简称" label="A股简称" align="center" width="80">
      </el-table-column>
      <el-table-column prop="所属区域" label="所属区域" align="center" show-overflow-tooltip>
      </el-table-column>
      <el-table-column prop="股票代码" label="股票代码" align="center" width="75">
      </el-table-column>
      <el-table-column prop="主营业务" label="主营业务" align="center">
      </el-table-column>
      <el-table-column prop="经营范围" label="经营范围" align="center" show-overflow-tooltip>
      </el-table-column>
      <el-table-column prop="公司简介" label="公司简介" align="center" show-overflow-tooltip>
      </el-table-column>
      <el-table-column prop="总股本" label="总股本" align="center" width="80">
      </el-table-column>
      <el-table-column prop="发行量" label="发行量" align="center" width="60">
      </el-table-column>
      <el-table-column prop="发行价格" label="发行价格" align="center" width="60">
      </el-table-column>
      <el-table-column prop="发行日期" label="发行日期" align="center" width="80">
      </el-table-column>
      <el-table-column prop="注册资本" label="注册资本" align="center" width="80">
      </el-table-column>
      <el-table-column prop="成立日期" label="成立日期" align="center" width="80">
      </el-table-column>
      <el-table-column prop="是否注册制" label="是否注册制" align="center" width="80">
      </el-table-column>
      <el-table-column prop="公司网址" label="公司网址" align="center" width="80">
      </el-table-column>
      <el-table-column prop="公司邮箱" label="公司邮箱" align="center" width="80">
      </el-table-column>
    </el-table>
    <div class="block" style="margin-top:15px;">
            <el-pagination align='center' @size-change="handleSizeChange" @current-change="handleCurrentChange" 
            :current-page="currentPage" 
            :page-sizes="5" 
            :page-size="pageSize" 
            layout="total, sizes, prev, pager, next, jumper" 
            :total="tableData.length">
            </el-pagination>
        </div>
    </div>
</template>

<script>
export default {
name:"CompanyInfomation",
data(){
  return{
    currentPage: 1, // 当前页码
    // total: 9, // 总条数
    pageSize: 10, // 每页的数据条数
   tableData:[
    {
        "公司名称": "浙江迪贝电气股份有限公司",
        "A股简称": "迪贝电气",
        "所属区域": "生产、销售：各类电机、新型机电元件、精密轴承（电机及新型机电元件专用）；货物进出口（依法须经批准的项目，经相关部门批准后方可开展经营活动）",
        "股票代码": "603320",
        "主营业务": "家用、商用、车载压缩机密封电机的研发、生产及销售，直流变频电机驱动控制器的研发、销售及硅钢经销业务。",
        "经营范围": "生产、销售：各类电机、新型机电元件、精密轴承（电机及新型机电元件专用）；货物进出口（依法须经批准的项目，经相关部门批准后方可开展经营活动）",
        "公司简介": "浙江迪贝电气股份有限公司系由浙江绍兴新星机电有限公司整体变更设立的股份有限公司。2011年4月1日，浙江迪贝机电集团有限公司、嵊州市迪贝工业炉有限公司、浙江卧龙创业投资有限公司、浙江嘉庆投资有限公司、浙江太极股权投资合伙企业（有限合伙）以及自然人吴储正女士签署《发起人协议》，决定将浙江绍兴新星机电有限公司整体变更设立为浙江迪贝电气股份有限公司。经信永中和会计师事务所审计，截至2011年2月28日，新星机电净资产为人民币10,557.22万元，按1:0.7104比例折合成7,500.00万股股份（每股面值1元），注册资本为人民币7,500.00万元。信永中和会计师事务所出具了XYZH/2010JNA2018-1号《验资报告》对迪贝电气（筹）注册资本的到位情况进行了审验。2011年4月17日，公司召开创立大会。2011年4月27日，绍兴市工商行政管理局向迪贝电气核发注册号330683000009331《企业法人营业执照》。",
        "总股本": 130031376.0,
        "发行量": 2500.0,
        "发行价格": 9.93,
        "发行日期": "2017-04-19",
        "注册资本": 13003.1376,
        "成立日期": "浙江省嵊州市三江街道迪贝路66号",
        "公司网址": "www.dibei.com",
        "公司邮箱": "info@dibei.com"
    },
    {
        "公司名称": "浙江航民股份有限公司",
        "A股简称": "航民股份",
        "所属区域": "纺织、印染及相关原辅材料的生产和销售，热电生产，煤炭（无储存）的销售，经营进出口业务（范围详见外经贸部门批文）。（依法须经批准的项目，经相关部门批准后方可开展经营活动）",
        "股票代码": "600987",
        "主营业务": "印染业务、热电业务、黄金饰品业务、非织造产品、织布业务、污水处理业务、海运业务",
        "经营范围": "纺织、印染及相关原辅材料的生产和销售，热电生产，煤炭（无储存）的销售，经营进出口业务（范围详见外经贸部门批文）。（依法须经批准的项目，经相关部门批准后方可开展经营活动）",
        "公司简介": "1997年12月30，经浙江省人民政府证券委员会浙证委[1997]168号文件批准，同意由航民集团作为主发起人，联合万向集团、杭钢集团、顺德金纺、二纺机、邵阳纺机等五家企业共同发起设立浙江航民股份有限公司。注册资本为贰亿元人民币。",
        "总股本": 1050818859.0,
        "发行量": 8500.0,
        "发行价格": 7.2,
        "发行日期": "2004-07-23",
        "注册资本": 105081.8859,
        "成立日期": "浙江省杭州市萧山区瓜沥镇航民村",
        "公司网址": "www.hmgf.com",
        "公司邮箱": "hmgf@hmgf.com"
    },
    {
        "公司名称": "上海骄成超声波技术股份有限公司",
        "A股简称": "骄成超声",
        "所属区域": "许可项目：货物进出口；技术进出口；Ⅱ、Ⅲ类射线装置销售；检验检测服务。（依法须经批准的项目，经相关部门批准后方可开展经营活动，具体经营项目以相关部门批准文件或许可证件为准）一般项目：从事超声波技术专业领域内的技术开发、技术转让、技术咨询、技术服务、技术推广、技术交流；金属切割及焊接设备制造；金属切割及焊接设备销售；金属表面处理及热处理加工；金属制品研发；金属制品销售；机械设备销售；塑料加工专用设备制造；塑料加工专用设备销售；电子元器件制造；智能控制系统集成；通用设备制造（不含特种设备制造）；专用设备制造（不含许可类专业设备制造）；普通机械设备安装服务；电子、机械设备维护（不含特种设备）；机械设备租赁。（除依法须经批准的项目外，凭营业执照依法自主开展经营活动）",
        "股票代码": "688392",
        "主营业务": "超声波焊接、裁切设备和配件的研发、设计、生产与销售。",
        "经营范围": "许可项目：货物进出口；技术进出口；Ⅱ、Ⅲ类射线装置销售；检验检测服务。（依法须经批准的项目，经相关部门批准后方可开展经营活动，具体经营项目以相关部门批准文件或许可证件为准）一般项目：从事超声波技术专业领域内的技术开发、技术转让、技术咨询、技术服务、技术推广、技术交流；金属切割及焊接设备制造；金属切割及焊接设备销售；金属表面处理及热处理加工；金属制品研发；金属制品销售；机械设备销售；塑料加工专用设备制造；塑料加工专用设备销售；电子元器件制造；智能控制系统集成；通用设备制造（不含特种设备制造）；专用设备制造（不含许可类专业设备制造）；普通机械设备安装服务；电子、机械设备维护（不含特种设备）；机械设备租赁。（除依法须经批准的项目外，凭营业执照依法自主开展经营活动）",
        "公司简介": "公司于2021年6月整体变更为股份公司，整体变更过程如下：2021年4月28日，容诚会计师出具审计报告（容诚审字[2021]200Z0438号），经审计确认，截至审计基准日2021年2月28日，骄成有限净资产为人民币11,608.22万元。2021年5月12日，中水致远资产评估有限公司出具了《资产评估报告》（中水致远评报字[2021]第020311号）。根据该《评估报告》，截至基准日2021年2月28日止，骄成有限资产账面价值23,371.92万元，评估值28,655.49万元；负债账面价值11,763.70万元，评估值11,697.89万元；净资产账面价值11,608.22万元，评估值16,957.60万元。2021年5月14日，骄成有限召开股东会并作出决议，同意骄成有限整体变更为股份有限公司，确认经审计的净资产为人民币11,608.22万元，经评估的净资产为人民币16,957.60万元。同意以原公司2021年2月28日为基准日经审计的净资产按2.1952：1比例折股，将有限公司整体变更成立股份公司，其中5,288万元计入注册资本，其余6,320.22万元计入公司资本公积。此次变更系由有限公司全体股东作为发起人，以其拥有的骄成有限经审计的全部净资产份额按上述比例折股，股份公司成立后各股东的持股比例保持不变。同日，公司全体发起人共同签署了《发起人协议》。2021年5月29日，公司召开创立大会暨第一次股东大会，审议通过《公司章程》等议案，选举和聘任了公司的董事、监事。2021年5月29日，容诚会计师出具《验资报告》（容诚验字[2021]200Z0065号），验证：截至2021年5月29日，骄成超声已收到全体发起人以经审计的账面净资产折合缴付的注册资本5,288万元，账面净资产超出注册资本部分计入资本公积。2021年6月21日，公司在上海市市场监督管理局办理完成注册登记手续，并领取统一社会信用代码为91310112798906038F的《营业执照》。",
        "总股本": 114800000.0,
        "发行量": 2050.0,
        "发行价格": 71.18,
        "发行日期": "2022-09-15",
        "注册资本": 11480.0,
        "成立日期": "上海市闵行区沧源路1488号2幢三层",
        "公司网址": "www.sbt-sh.com",
        "公司邮箱": "shanghaijiaocheng@sbt-sh.com"
    },
    {
        "公司名称": "金能科技股份有限公司",
        "A股简称": "金能科技",
        "所属区域": "粗苯、焦炉煤气、煤焦油、硫磺、巴豆醛、甲苯、二甲苯、纯苯、重质苯、氢气、萘、洗油、粗酚、焦油沥青、蒽油、轻油（苯）、甲醇、杂醇（甲醇）、液氧、液氨、氮气（压缩）、对甲酚、硫酸、对甲苯磺酸、混酚生产、销售（有效期限以许可证为准）；煤炭批发经营（符合国家标准的清洁煤）；炭黑、冶金焦炭、炭黑焦油、硫铵、硫酸钠、亚硫酸钠、无水硫酸钠、白炭黑、泡花碱、食品添加剂二氧化硅、饲料添加剂二氧化硅、食品添加剂山梨酸、饲料添加剂山梨酸、食品添加剂山梨酸钾、饲料添加剂山梨酸钾的生产销售（不含危险化学品）；城市供热；电力生产；本企业产品的技术研发；经营本企业生产、科研所需的原辅材料、仪器仪表、机械设备、零配件及技术的进出口业务；机械设备租赁（依法须经批准的项目，经相关部门批准后方可开展经营活动）",
        "股票代码": "603113",
        "主营业务": "炼焦和化产、煤焦油深加工和炭黑生产、苯加氢和对甲基苯酚生产、泡花碱和白炭黑生产、山梨酸及山梨酸钾生产、焦炉煤气制甲醇、燃气轮机联合循环热电联产等业务。",
        "经营范围": "粗苯、焦炉煤气、煤焦油、硫磺、巴豆醛、甲苯、二甲苯、纯苯、重质苯、氢气、萘、洗油、粗酚、焦油沥青、蒽油、轻油（苯）、甲醇、杂醇（甲醇）、液氧、液氨、氮气（压缩）、对甲酚、硫酸、对甲苯磺酸、混酚生产、销售（有效期限以许可证为准）；煤炭批发经营（符合国家标准的清洁煤）；炭黑、冶金焦炭、炭黑焦油、硫铵、硫酸钠、亚硫酸钠、无水硫酸钠、白炭黑、泡花碱、食品添加剂二氧化硅、饲料添加剂二氧化硅、食品添加剂山梨酸、饲料添加剂山梨酸、食品添加剂山梨酸钾、饲料添加剂山梨酸钾的生产销售（不含危险化学品）；城市供热；电力生产；本企业产品的技术研发；经营本企业生产、科研所需的原辅材料、仪器仪表、机械设备、零配件及技术的进出口业务；机械设备租赁（依法须经批准的项目，经相关部门批准后方可开展经营活动）",
        "公司简介": "本公司系由金能有限整体变更设立的股份有限公司。2012年3月20日，金能有限全体股东作为发起人共同签署了《关于变更设立金能科技股份有限公司发起人协议书》，同意以截至2012年2月29日经审计的净资产1,486,526,705.21元，按照1：0.4027的比例折合股本598,639,455股，余额扣除专项储备金后剩余部分计入公司的资本公积金，折股后的股份公司的注册资本为598,639,455元。各发起人在股份有限公司设立时持有的股权比例与其在金能有限原持有的股权比例保持一致。2012年3月22日，中瑞岳华出具了中瑞岳华验字[2012]第0050号《验资报告》，确认发起人的出资已全部足额缴付；2012年3月26日，金能科技获得德州市工商局颁发的注册号为371425018005082的《企业法人营业执照》。",
        "总股本": 847949240.0,
        "发行量": 7730.0,
        "发行价格": 13.37,
        "发行日期": "2017-04-28",
        "注册资本": 84794.924,
        "成立日期": "山东省德州市齐河县工业园区西路1号",
        "公司网址": "www.jncoke.com",
        "公司邮箱": "jinnengkeji@jin-neng.com"
    },
    {
        "公司名称": "江苏连云港港口股份有限公司",
        "A股简称": "连云港",
        "所属区域": "码头和其他港口设施经营；为旅客提供候船及上、下船舶设施和服务；港口货物装卸、仓储服务；船舶港口服务业务经营（仅限为船舶提供岸电）；普通货运；港口机械、设施、设备租赁、维修服务；机械设备、电器设备制造、安装、维修；工索具制造、销售；散货包装服务；实业投资。（依法须经批准的项目，经相关部门批准后方可开展经营活动）***许可项目：特种设备安装改造修理（依法须经批准的项目，经相关部门批准后方可开展经营活动，具体经营项目以审批结果为准）",
        "股票代码": "601008",
        "主营业务": "港口货物装卸、堆存及相关港务管理服务等。",
        "经营范围": "码头和其他港口设施经营；为旅客提供候船及上、下船舶设施和服务；港口货物装卸、仓储服务；船舶港口服务业务经营（仅限为船舶提供岸电）；普通货运；港口机械、设施、设备租赁、维修服务；机械设备、电器设备制造、安装、维修；工索具制造、销售；散货包装服务；实业投资。（依法须经批准的项目，经相关部门批准后方可开展经营活动）***许可项目：特种设备安装改造修理（依法须经批准的项目，经相关部门批准后方可开展经营活动，具体经营项目以审批结果为准）",
        "公司简介": "江苏连云港港口股份有限公司于2001年9月25日经江苏省人民政府苏政复［2001］154号文批准，由连云港港务局（现连云港港口集团有限公司）、中国信达资产管理公司、兖州煤业股份有限公司、中国煤炭工业进出口集团连云港公司（现中煤连云港进出口有限公司）、中国连云港外轮代理公司（现中国连云港外轮代理有限公司）共同发起设立，连云港港务局以其下属部分经营性资产出资12,498.97万元，中国信达资产管理公司以受让港务局的一部分资产出资4,577.09万元，兖州煤业股份有限公司、中国煤炭工业进出口集团连云港公司、中国连云港外轮代理公司以货币形式分别出资176.04万元。上述各股东的出资均按1:0.6533的折股比例折为股份公司的股份。公司设立时总股本11,500万股，其中连云港港务局8,165万股，中国信达资产管理公司2,990万股，兖州煤业股份有限公司、中国煤炭工业进出口集团连云港公司、中国连云港外轮代理公司各115万股。公司于2001年10月15日在江苏省工商行政管理局领取了企业法人营业执照，注册号为3200001105341。",
        "总股本": 1240638006.0,
        "发行量": 15000.0,
        "发行价格": 4.98,
        "发行日期": "2007-04-13",
        "注册资本": 124063.8006,
        "成立日期": "中国(江苏)自由贸易试验区连云港片区连云区庙岭港区港口四路8号",
        "公司网址": "www.jlpcl.com",
        "公司邮箱": "lygport@jlpcl.com"
    },
    {
        "公司名称": "莲花控股股份有限公司",
        "A股简称": "莲花控股",
        "所属区域": "许可项目：肥料生产（依法须经批准的项目，经相关部门批准后方可开展经营活动，具体经营项目以相关部门批准文件或许可证件为准）一般项目：企业总部管理；食品销售（仅销售预包装食品）;食品互联网销售（仅销售预包装食品）;饲料原料销售；新鲜水果批发；食用农产品批发；化工产品生产（不含许可类化工产品）;化工产品销售（不含许可类化工产品）;食品进出口；货物进出口；技术进出口；计算机系统服务；数据处理服务；水产品批发；肥料销售；技术服务、技术开发、技术咨询、技术交流、技术转让、技术推广（除依法须经批准的项目外，凭营业执照依法自主开展经营活动）",
        "股票代码": "600186",
        "主营业务": "味精及其副产品的生产与销售。",
        "经营范围": "许可项目：肥料生产（依法须经批准的项目，经相关部门批准后方可开展经营活动，具体经营项目以相关部门批准文件或许可证件为准）一般项目：企业总部管理；食品销售（仅销售预包装食品）;食品互联网销售（仅销售预包装食品）;饲料原料销售；新鲜水果批发；食用农产品批发；化工产品生产（不含许可类化工产品）;化工产品销售（不含许可类化工产品）;食品进出口；货物进出口；技术进出口；计算机系统服务；数据处理服务；水产品批发；肥料销售；技术服务、技术开发、技术咨询、技术交流、技术转让、技术推广（除依法须经批准的项目外，凭营业执照依法自主开展经营活动）",
        "公司简介": "公司系由河南省莲花味精集团有限公司于1998年7月2日独家发起设立，发起人以其净资产折为国家股20000万股，经1998年6月15日发行公众股后，上市时总股本达30000万股，其内部职工股1000万股于公众股9000万股1998年8月25日在上交所上市交易期满半年后上市流通。",
        "总股本": 1793251141.0,
        "发行量": 10000.0,
        "发行价格": 7.01,
        "发行日期": "1998-06-15",
        "注册资本": 179325.1141,
        "成立日期": "河南省项城市颍河路18号",
        "公司网址": "www.mylotushealth.com",
        "公司邮箱": "lhg@mylotushealth.com"
    },
    {
        "公司名称": "南京诺唯赞生物科技股份有限公司",
        "A股简称": "诺唯赞",
        "所属区域": "生物试剂、酶制试剂研发、生产、销售、技术咨询及技术服务；生化试剂及耗材、机电设备、电子产品销售；自营和代理各类商品及技术的进出口业务（国家限定企业经营或禁止进出口商品和技术的除外）。（依法须经批准的项目，经相关部门批准后方可开展经营活动）一般项目：实验分析仪器销售；实验分析仪器制造；机械设备研发；技术服务、技术开发、技术咨询、技术交流、技术转让、技术推广（除依法须经批准的项目外，凭营业执照依法自主开展经营活动）",
        "股票代码": "688105",
        "主营业务": "围绕酶、抗原、抗体等功能性蛋白及高分子有机材料进行技术研发和产品开发。",
        "经营范围": "生物试剂、酶制试剂研发、生产、销售、技术咨询及技术服务；生化试剂及耗材、机电设备、电子产品销售；自营和代理各类商品及技术的进出口业务（国家限定企业经营或禁止进出口商品和技术的除外）。（依法须经批准的项目，经相关部门批准后方可开展经营活动）一般项目：实验分析仪器销售；实验分析仪器制造；机械设备研发；技术服务、技术开发、技术咨询、技术交流、技术转让、技术推广（除依法须经批准的项目外，凭营业执照依法自主开展经营活动）",
        "公司简介": "2020年5月26日，立信出具信会师报字[2020]第ZA14610号《南京诺唯赞生物科技有限公司审计报告及财务报表(2020年1至3月）》，截至2020年3月31日，诺唯赞有限经审计的账面净资产为69,728.54万元。2020年5月26日，银信资产评估有限公司出具银信评报字(2020)沪第0369号《南京诺唯赞生物科技有限公司拟股份制改制涉及的南京诺唯赞生物科技有限公司股东全部权益价值资产评估报告》，按照资产基础法评估，截至2020年3月31日，诺唯赞有限的股东全部权益价值评估值为94,009.63万元。2020年5月27日，诺唯赞有限当时的全体30名股东作为发起人签署《南京诺唯赞生物科技股份有限公司发起人协议书》。2020年5月28日，诺唯赞召开创立大会暨2020年第一次临时股东大会并作出决议，同意诺唯赞有限以整体变更设立股份有限公司的方式，依法变更为股份有限公司。诺唯赞有限以截至2020年3月31日的经审计净资产697,285,361.85元、按照1.936903783:1的比例折合成股本360,000,000股，其余337,285,361.85元计入诺唯赞的资本公积。2020年5月29日，立信出具信会师报字[2020]第ZA14947号《验资报告》，经其审验，截至2020年5月28日，发行人已根据《公司法》有关规定及公司折股方案，将诺唯赞有限截至2020年3月31日止经审计的所有者权益（净资产）697,285,361.85元，按1.936903783:1的比例折合股份总额360,000,000股，每股1元，共计股本360,000,000元，大于股本部分337,285,361.85元计入资本公积。2020年6月4日，南京市市场监督管理局就本次股份公司设立事宜向诺唯赞核发变更后的《营业执照》（统一社会信用代码：91320192589435065R)。",
        "总股本": 400010000.0,
        "发行量": 4001.0,
        "发行价格": 55.0,
        "发行日期": "2021-11-03",
        "注册资本": 40001.0,
        "成立日期": "江苏省南京经济技术开发区科创路红枫科技园C1-2栋东段1-6层",
        "公司网址": "www.vazyme.com",
        "公司邮箱": "irm@vazyme.com"
    },
    {
        "公司名称": "上海荣泰健康科技股份有限公司",
        "A股简称": "荣泰健康",
        "所属区域": "许可项目：第二类增值电信业务。（依法须经批准的项目，经相关部门批准后方可开展经营活动，具体经营项目以相关部门批准文件或许可证件为准）一般项目：家用电器研发，家用电器制造，家用电器销售，电子元器件与机电组件设备制造，集成电路制造，虚拟现实设备制造，机械电气设备制造，电机及其控制系统研发，体育用品及器材制造，体育用品及器材零售，体育用品及器材批发，体育健康服务，电子专用材料研发，机械电气设备销售，智能机器人的研发，智能机器人销售，智能家庭消费设备销售，技术服务、技术开发、技术咨询、技术交流、技术转让、技术推广，工业设计服务，第一类医疗器械生产，第一类医疗器械销售，货物进出口，技术进出口。（除依法须经批准的项目外，凭营业执照依法自主开展经营活动）",
        "股票代码": "603579",
        "主营业务": "按摩器具的设计、研发、生产和销售。",
        "经营范围": "许可项目：第二类增值电信业务。（依法须经批准的项目，经相关部门批准后方可开展经营活动，具体经营项目以相关部门批准文件或许可证件为准）一般项目：家用电器研发，家用电器制造，家用电器销售，电子元器件与机电组件设备制造，集成电路制造，虚拟现实设备制造，机械电气设备制造，电机及其控制系统研发，体育用品及器材制造，体育用品及器材零售，体育用品及器材批发，体育健康服务，电子专用材料研发，机械电气设备销售，智能机器人的研发，智能机器人销售，智能家庭消费设备销售，技术服务、技术开发、技术咨询、技术交流、技术转让、技术推广，工业设计服务，第一类医疗器械生产，第一类医疗器械销售，货物进出口，技术进出口。（除依法须经批准的项目外，凭营业执照依法自主开展经营活动）",
        "公司简介": "公司前身为荣泰有限，2013年10月10日，荣泰有限股东会通过整体变更设立股份有限公司之决议。公司以经中汇会计师审计的截至2013年6月30日净资产112333434.90元折合为公司的股本总额5000万元，净资产超过股本总额5，000万元的部分计入发行人的资本公积。2013年10月21日，中汇会计师出具中汇会验【2013】2846号《验资报告》对本次整体变更的出资情况进行了确认。2013年10月31日，荣泰科技在上海市工商行政管理局正式办理工商登记，领取了注册号为310118002087613的企业法人营业执照，公司注册资本5000万元，法人代表林琪。",
        "总股本": 179377241.0,
        "发行量": 1750.0,
        "发行价格": 44.66,
        "发行日期": "2016-12-29",
        "注册资本": 17937.7241,
        "成立日期": "上海市青浦区朱枫公路1226号",
        "公司网址": "www.rotai.com",
        "公司邮箱": "public@chinarongtai.com"
    },
    {
        "公司名称": "江苏徐矿能源股份有限公司",
        "A股简称": "苏能股份",
        "所属区域": "原煤开采、煤炭洗选、加工、煤炭批发经营、电力生产，煤化工生产与销售，公路货运，能源投资，固定资产租赁，废旧物资回收、销售，化肥销售，货物仓储服务，企业重组及相关咨询服务，企业资产管理，企业资产托管，国内外贸易、技术咨询与服务。（依法须经批准的项目，经相关部门批准后方可开展经营活动）一般项目:劳务服务（不含劳务派遣）（除依法须经批准的项目外，凭营业执照依法自主开展经营活动）",
        "股票代码": "600925",
        "主营业务": "煤炭采掘、洗选加工、销售，以及发电等业务。",
        "经营范围": "原煤开采、煤炭洗选、加工、煤炭批发经营、电力生产，煤化工生产与销售，公路货运，能源投资，固定资产租赁，废旧物资回收、销售，化肥销售，货物仓储服务，企业重组及相关咨询服务，企业资产管理，企业资产托管，国内外贸易、技术咨询与服务。（依法须经批准的项目，经相关部门批准后方可开展经营活动）一般项目:劳务服务（不含劳务派遣）（除依法须经批准的项目外，凭营业执照依法自主开展经营活动）",
        "公司简介": "2014年9月，江苏省国资委出具了《关于同意徐州矿务集团有限公司主体产业改革上市方案的批复》（苏国资复[2014]86号），同意徐矿集团以部分煤炭产业资产和持有的秦陇运销100%股权出资；徐矿集团全资子公司江苏能投以持有的阿克苏热电100%股权、徐矿电厂65%股权出资；徐矿集团全资子公司陕西能化以持有的百贯沟煤业100%股权、郭家河煤业60%股权、新安煤业100%股权出资，共同发起成立徐矿股份。2014年9月，安永华明会计师事务所（特殊普通合伙）就上述拟出资资产出具了“安永华明(2014)专字第61106565_B01号”《专项审计报告》，审计确认江苏徐矿能源股份有限公司（筹）于2013年12月31日的模拟合并财务状况为：资产总额14,084,695,345.37元，负债总额10,770,279,128.05元，净资产3,314,416,217.33元。2014年9月，北京中企华资产评估有限责任公司出具了“中企华评报字(2014)第1262号”《徐州矿务集团有限公司拟连同所属江苏省能源投资有限公司和徐矿集团陕西能源化工有限公司发起设立股份公司项目资产评估总报告书》，确认在评估基准日(2013年12月31日），徐矿集团出资资产的评估价值为357,701.25万元，陕西能化出资资产的评估价值为262,013.60万元，江苏能投出资资产的评估价值为75,023.99万元。江苏省人民政府国有资产监督管理委员会对上述评估结果予以备案（苏国资评备[2014]36号）。2014年10月，徐矿集团、陕西能化与江苏能投签署了《江苏徐矿能源股份有限公司发起人协议》。2014年11月，江苏省国资委出具了《关于江苏徐矿能源股份有限公司（筹）国有股权管理有关事项的批复》（苏国资复[2014]104号），同意徐矿股份设总股本500,000万股，其中徐矿集团持有257,435万股，占总股本的51.49%；陕西能化持有188,570万股，占总股本的37.71%；江苏能投持有53,995万股，占总股本的10.80%。2014年12月，徐矿股份取得了江苏省工商行政管理局出具的《公司准予设立登记通知书》((00000328)公司设立[2014]第1203001号）和营业执照。统一社会信用代码为913200003238430028。",
        "总股本": 6888888889.0,
        "发行量": 68888.8889,
        "发行价格": 6.18,
        "发行日期": "2023-03-17",
        "注册资本": 688888.8889,
        "成立日期": "江苏省徐州市徐州经济技术开发区软件园E2楼三层",
        "公司网址": "xknygf.com",
        "公司邮箱": "xkgfbgs@163.com"
    }
  ]
}
},
methods: {
                //每页条数改变时触发 选择一页显示多少行
                handleSizeChange(val) {
                    console.log(`每页 ${val} 条`);
                    this.currentPage = 1;
                    this.pageSize = val;
                },
                //当前页改变时触发 跳转其他页
                handleCurrentChange(val) {
                    console.log(`当前页: ${val}`);
                    this.currentPage = val;
                                }
}
}
</script>

<style scoped>
* {
  text-decoration: none;
  list-style: none;
  margin: 0;
  padding: 0;
}
</style>